иб/src/Documents/СоставлениеПитания/СоставлениеПитания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СоставлениеПитания</name>
  <attributes>
    <name>Кормосмесь</name>
    <type>
      <types>CatalogRef.Удобрения</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Корма</name>
    <attributes>
      <name>Корм</name>
      <type>
        <types>CatalogRef.Удобрения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

иб/src/Documents/СоставлениеПитания/ObjectModule.bsl
#Область ПроведениеДокумета

Процедура ОбработкаПроведения(Отказ, Режим)
	
	лМасса = 0;
	// регистр сжсвРационы
	Движения.сжсвКормосмеси.Записывать = Истина;
	Для Каждого ТекСтрокаКорма Из Корма Цикл
		Движение = Движения.сжсвКормосмеси.Добавить();
		Движение.Период = Дата;
		Движение.Кормосмесь = Кормосмесь;
		Движение.Корм = ТекСтрокаКорма.Корм;
		Движение.Количество = ТекСтрокаКорма.Количество;
		
		лМасса = лМасса + ТекСтрокаКорма.Количество;
		
	КонецЦикла;
	
	// регистр сжсвНормыРасходаНоменклатуры
	
	Движения.сжсвНормыРасходаНоменклатуры.Записывать = Истина;
	Движение = Движения.сжсвНормыРасходаНоменклатуры.Добавить();
	Движение.Период = Дата;
	Движение.Кормосмесь = Кормосмесь;
	Движение.Количество = лМасса;
	
КонецПроцедуры

#КонецОбласти
